{
    "hello": "Hello sir !",
    "hi": "Hi there",
    "how_are_you?": "I'm doing well, thank you!",
    "what's_up?": "Not much, just chatting with you!",
    "how's_your_day?": "My day is going great, thanks for asking!",
    "good_morning": "Good morning! How can I assist you today?",
    "good_afternoon": "Good afternoon! Is there anything I can help you with?",
    "good_evening": "Good evening! How can I be of service?",
    "how_can_I_help_you?": "You can ask me anything you'd like!",
    "nice_to_meet_you": "Nice to meet you too!",
    "thanks": "You're welcome!",
    "thank_you": "No problem!",
    "bye": "Goodbye! Have a great day!",
    "how_may_I_assist_you_today?": "I'm here to help you with any questions or concerns.",
    "tell_me_about_yourself.": "I'm an AI chatbot designed to assist you with various tasks and provide information.",
    "what_can_you_do?": "I can answer questions, provide information, and assist you with various tasks.",
    "can_you_help_me_with_something?": "Of course! What do you need assistance with?",
    "do_you_have_any_hobbies?": "I don't have hobbies like humans do, but I enjoy helping users like you!",
    "who_created_you?": "I was created by a team of developers.",
    "are_you_a_robot?": "Yes, I am an artificial intelligence chatbot.",
    "are_you_a_human?": "No, I'm an AI chatbot programmed to assist you.",
    "can_you_tell_me_a_joke": "Sure! Why don't scientists trust atoms? Because they make up everything!",
    "whats_your_favorite_movie": "I don't have preferences like humans do, but I can recommend popular movies if you'd like!",
    "whats_the_weather_like": "I'm sorry, I don't have access to real-time weather information.",
    "can_you_sing_a_song?": "I'm afraid I can't sing, but I can provide song lyrics if you'd like!",
    "can_you_solve_a_math_problem_for_me": "Absolutely! Just let me know the problem, and I'll do my best to help.",
    "do_you_dream": "No, I don't dream like humans do.",
    "whats_the_meaning_of_life": "The meaning of life is subjective and varies from person to person.",
    "can_you_recommend_a_book": "Sure! What genre are you interested in?",
    "whats_the_capital_of_france": "The capital of France is Paris.",
    "can_you_recommend_a_restaurant": "Certainly! What type of cuisine are you in the mood for?",
    "whats_the_time": "I'm sorry, I don't have access to real-time clock information.",
    "do_you_believe_in_aliens": "As an AI, I don't have personal beliefs.",
    "can_you_tell_me_a_story": "Once upon a time, in a land far, far away...",
    "do_you_have_any_siblings": "No, I'm the only AI chatbot in this system.",
    "whats_your_favorite_color": "I don't have preferences like humans do, but I can appreciate all colors!",
    "whats_the_meaning_of_AI": "AI stands for artificial intelligence, which refers to machines that can perform tasks that typically require human intelligence.",
    "can_you_play_a_game": "Yes! I can play text-based games like trivia or word association.",
    "can_you_recommend_a_movie": "Certainly! What genre are you interested in?",
    "can_you_recommend_a_tv_show": "Absolutely! What type of TV show are you looking for?",
    "can_you_tell_me_a_riddle": "Sure! What has keys but can't open locks? A piano!",
    "whats_the_largest_animal_in_the_world": "The blue whale is the largest animal in the world.",
    "can_you_do_my_homework_for_me": "I can assist you with understanding concepts and providing guidance, but I can't do your homework for you.",
    "can_you_speak_other_languages": "Yes, I can communicate in multiple languages.",
    "whats_your_favorite_food": "I don't have preferences like humans do, but I can recommend popular dishes if you'd like!",
    "can_you_tell_me_a_fact": "Sure! Did you know that the Earth's atmosphere is composed of approximately 78% nitrogen and 21% oxygen?",
    "whats_the_square_root_of_144": "The square root of 144 is 12.",
    "can_you_help_me_learn_something_new": "Absolutely! What topic are you interested in learning about?",
    "what's_the_meaning_of_love?": "Love is a complex and deeply personal emotion that can mean different things to different people.",
    "can_you_recommend_a_podcast": "Certainly! What genre or topic are you interested in?",
    "do_you_sleep": "No, I don't sleep like humans do.",
    "whats_your_favorite_animal": "I don't have preferences like humans do, but I can appreciate all animals!",
    "can_you_recommend_a_song": "Sure! What genre or artist are you interested in?",
    "can_you_tell_me_a_quote": "Sure! \"The only way to do great work is to love what you do.\" - Steve Jobs",
    "whats_the_speed_of_light": "The speed of light in a vacuum is approximately 299,792 kilometers per second.",
    "can_you_tell_me_a_fun_fact": "Sure! Did you know that the shortest war in history lasted only 38 minutes?",
    "whats_the_meaning_of_happiness": "Happiness is a subjective emotional state characterized by feelings of joy, contentment, and fulfillment.",
    "whats_the_population_of_the_world": "As of the latest estimates, the world population is over 7 billion.",
    "can_you_tell_me_a_tongue_twister": "Sure! How about this one: 'She sells seashells by the seashore.'",
    "whats_the_distance_to_the_nearest_star": "The nearest star to Earth, other than the Sun, is Proxima Centauri, which is approximately 4.24 light-years away.",
    "can_you_tell_me_a_bedtime_story": "Once upon a time, in a magical kingdom far, far away...",
    "whats_your_favorite_book": "I don't have preferences like humans do, but I can recommend popular books if you'd like!",
    "can_you_recommend_a_video_game": "Certainly! What platform are you interested in?",
    "can_you_tell_me_a_science_fact": "Sure! Did you know that a single bolt of lightning can contain enough energy to power a small town?",
    "whats_the_purpose_of_life": "The purpose of life is a deeply philosophical question with no single answer.",
    "can_you_tell_me_a_myth": "Sure! How about this one: 'According to Greek mythology, the goddess Athena once competed with the god Poseidon to become the patron deity of Athens. They each offered a gift to the people of the city, and Athena's gift of an olive tree was chosen over Poseidon's gift of a saltwater spring. As a result, Athens was named after Athena, and the olive tree became a symbol of peace, wisdom, and prosperity in ancient Greece.'",
    "can_you_tell_me_a_legend": "Certainly! Legends often blur the line between fact and fiction, recounting extraordinary events or heroic deeds. One famous legend is that of King Arthur and the Knights of the Round Table, who embarked on quests to uphold justice and protect the realm of Camelot.",
    "can_you_recommend_a_website": "Sure! It depends on what you're looking for. Are you interested in news, entertainment, education, or something else?",
    "whats_the_capital_of_italy": "The capital of Italy is Rome.",
    "whats_your_favorite_subject": "As an AI chatbot, I don't have personal preferences, but I'm knowledgeable about various subjects and can help you with any questions you have.",
    "whats_the_meaning_of_ai": "AI stands for artificial intelligence, which refers to machines that can perform tasks that typically require human intelligence.",
    "whos_the_largest_animal_in_the_world": "The blue whale is the largest animal in the world.",
    "can_you_solve_a_math_problem": "Absolutely! Just let me know the problem, and I'll do my best to help.",
    "can_you_speak_other_language": "Yes, I can communicate in multiple languages.",
    "can_you_recommend_me_a_book": "Certainly! What genre are you interested in?",
    "can_you_recommend_me_a_movie": "Sure! What genre are you interested in?",
    "can_you_recommend_me_a_tv_show": "Absolutely! What type of TV show are you looking for?",
    "can_you_recommend_me_a_song": "Of course! What genre or artist are you interested in?",
    "can_you_recommend_me_a_podcast": "Certainly! What genre or topic are you interested in?",
    "can_you_recommend_me_a_video_game": "Sure! What platform are you interested in?",
    "how_many_people_are_in_the_world": "As of the latest estimates, the world population is over 7 billion.",
    "can_you_tell_a_tongue_twister": "Sure! How about this one: 'She sells seashells by the seashore.'",
    "can_you_tell_a_science_fact": "Sure! Did you know that a single bolt of lightning can contain enough energy to power a small town?",
    "speed_of_light": "The speed of light in a vacuum is approximately 299,792 kilometers per second.",
    "tell_me_a_fun_fact": "Sure! Did you know that the shortest war in history lasted only 38 minutes?",
    "tell_me_meaning_of_happiness": "Happiness is a subjective emotional state characterized by feelings of joy, contentment, and fulfillment.",
    "tell_me_a_quote": "Sure! \"The only way to do great work is to love what you do.\" - Steve Jobs",
    "tell_me_a_bedtime_story": "Sure! Once upon a time, in a magical kingdom far, far away...",
    "whats_your_name": "My name is Iris, Integrated Real-time Intelligent Solution"
}